app/controllers/login_controller.rb

  def verificar
     usuario = params[:email]
     contrasenia = params[:clave]

     if  User.find_by(email: params[:email] , clave:params[:clave])
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'a@a' AND `users`.`clave` = '123' LIMIT 1

   def registrar


     nuevo=User.create(email: params[:email],  clave:params[:clave] ,nombre:params[:nombre])
---
INSERT INTO `users` (`nombre`, `email`, `clave`, `created_at`, `updated_at`) VALUES ('gg', 'gg@', '123', '2017-07-11 00:26:27', '2017-07-11 00:26:27')