app/controllers/proyecto_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` IS NULL LIMIT 1
SELECT `cursos`.* FROM `cursos`
SELECT proyectos.nombre pNo,proyectos.rating pRa, cursos.nombre cno,proyectos.id pid FROM `proyectos` INNER JOIN `cursos` ON `cursos`.`id` = `proyectos`.`curso_id` WHERE `proyectos`.`user_id` = 1
SELECT proyectos.nombre pNo,proyectos.desc desc,proyectos.rating pRa, cursos.nombre cno,proyectos.id pid FROM `proyectos` INNER JOIN `cursos` ON `cursos`.`id` = `proyectos`.`curso_id` WHERE `proyectos`.`user_id` = 1 AND `proyectos`.`sigo` = 1
---
  def ver
currenU=User.find_by(email:session[:usuario])
@nombrepag=currenU.nombre
  usuario=User.find_by(email:session[:usuario])
  puts @usuario.to_json
  @Cursos=Curso.all
  @proyectos=Proyecto.select("proyectos.nombre pNo,proyectos.rating pRa, cursos.nombre cno,proyectos.id pid").joins(:curso).where(user_id:usuario.id)
  @siguiendo=Proyecto.select("proyectos.desc des,proyectos.nombre Sno,proyectos.rating sra, cursos.nombre snoo,proyectos.id sid").joins(:curso).where(user_id:usuario.id,sigo:1)

SELECT  `cursos`.* FROM `cursos` WHERE `cursos`.`nombre` = 'Fisica' LIMIT 1
SELECT  `proyectos`.* FROM `proyectos` WHERE `proyectos`.`id` IS NULL LIMIT 1
UPDATE `proyectos` SET `nombre` = 'Ahora q dices', `desc` = ' dsadsad', `updated_at` = '2017-07-10 05:20:11' WHERE `proyectos`.`id` = 8
---
  def modificar

    cursoid=Curso.find_by(nombre:params["CursosC"])
    nuevo=Proyecto.find_by(id:params["idproyec"])
    nuevo.nombre=params["noP"]
    nuevo.desc=params["deC"]
    nuevo.curso_id=cursoid.id
    nuevo.save

SELECT  `proyectos`.* FROM `proyectos` WHERE `proyectos`.`id` IS NULL LIMIT 1
DELETE FROM `proyectos` WHERE `proyectos`.`id` = 6
---
  def eliminar
    proyecto=Proyecto.find_by(id:params["@idPro"])
    proyecto.destroy

SELECT  `proyectos`.* FROM `proyectos` WHERE `proyectos`.`id` = 9 LIMIT 1
UPDATE `proyectos` SET `sigo` = 0, `updated_at` = '2017-07-10 05:44:09' WHERE `proyectos`.`id` = 9
---
  def interesado

    proyecto=Proyecto.find_by(id:params["@idPro"])
    proyecto.sigo=0
    proyecto.save